tap "andreybleme/lazycontainer", "https://github.com/andreybleme/lazycontainer"
tap "ankitpokhrel/jira-cli"
tap "antoniorodr/memo"
tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "espanso/espanso"
tap "james-see/tap"
tap "jetbrains/junie", "https://github.com/JetBrains/homebrew-junie.git"
tap "max-sixty/worktrunk"
tap "openclaw/tap"
tap "steipete/tap"
tap "th-ch/youtube-music"
tap "yakitrak/yakitrak"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# OpenType text shaping engine
brew "harfbuzz"
# TIFF library and utilities
brew "libtiff"
# Pure Scala Artifact Fetching
brew "coursier"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Terminal document viewer for .docx files
brew "doxx"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Fast and simple Node.js version manager
brew "fnm"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# New file format for still image compression
brew "jpeg-xl"
# Image format providing lossless and lossy compression for web images
brew "webp"
# GitHub command-line tool
brew "gh"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# Java EE application server
brew "glassfish"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for USB device access
brew "libusb"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# LLM inference in C/C++
brew "llama.cpp"
# Access large language models from the command-line
brew "llm"
# Find what models run on your hardware
brew "llmfit"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# Powerful paging program
brew "most"
# NCurses Disk Usage
brew "ncdu"
# Easy to use, powerful, and reliable system to process and distribute data
brew "nifi"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Development kit for the Java programming language
brew "openjdk@17"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# Tool for managing OCI containers and pods
brew "podman"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Python version management
brew "pyenv", args: ["HEAD"]
# Python bindings for v5 of Qt
brew "pyqt@5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Safe, concurrent, practical language
brew "rust"
# Build tool for Scala projects
brew "sbt"
# Scala language runner and build tool
brew "scala-cli"
# Non-interactive SSH password auth
brew "sshpass"
# Multi-modal AI tool to extract and summarize content
brew "summarize"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# Terminal multiplexer
brew "tmux"
# Lightweight BitTorrent client
brew "transmission-cli", restart_service: :changed
# Markup-based typesetting system
brew "typst"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Tracks most-used directories to make cd smarter
brew "z"
# Compression and file packaging/archive utility
brew "zip"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Memory training application
cask "anki"
# Agent orchestration platform
cask "antigravity"
# Allows connection to a computer remotely
cask "anydesk"
# Application uninstaller
cask "appcleaner"
# SQL client and database management tool
cask "arctype"
# Multi-track audio editor and recorder
cask "audacity"
# Audio utility
cask "background-music"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Utility that prevents the system from going to sleep
cask "caffeine"
# E-books management software
cask "calibre"
# 3D printing slicer software
cask "chitubox"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# Generate a timeline of your day, automatically
cask "dayflow"
# Voice and text chat software
cask "discord"
# Eclipse integrated development environment
cask "eclipse-ide"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Collaborative team software
cask "figma"
# Official CLI tool for Concourse CI
cask "fly"
cask "font-monaspace"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Graphically shows disk usage within a file system
cask "grandperspective"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# Menu bar manager
cask "jordanbaird-ice"
# File archiver
cask "keka"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Allows installation and use of software designed for Windows
cask "playonmac"
# Home media player
cask "plex"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# AI-powered writing assistant
cask "rewritebar"
# Displays folders and archives of images and PDF files
cask "sequential"
# Comic viewer/reader
cask "simple-comic"
# Video game digital distribution service
cask "steam"
# Quicklook extension for source files
cask "syntax-highlight"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Open-source code editor
cask "visual-studio-code"
# Game Boy Advance emulator
cask "visualboyadvance-m"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# Multimedia player
cask "vlc"
# Simple menu bar app to download YouTube movies
cask "youtube-downloader"
# YouTube Music Desktop App
cask "th-ch/youtube-music/youtube-music"
# Multiplayer code editor
cask "zed"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "anseki.vscode-color"
vscode "anthropic.claude-code"
vscode "benjaminbenais.copilot-theme"
vscode "bierner.markdown-mermaid"
vscode "charkoal.charkoal"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "dakara.transformer"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "earshinov.filter-lines"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "garytyler.darcula-pycharm"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "jakeboone02.cypher-query-language"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jetbrains.kotlin"
vscode "johnpapa.vscode-peacock"
vscode "k--kato.intellij-idea-keybindings"
vscode "magicstack.magicpython"
vscode "markwhen.markwhen"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "phplasma.csv-to-table"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "saoudrizwan.claude-dev"
vscode "secanis.jenkinsfile-support"
vscode "tomoki1207.pdf"
vscode "trinm1709.dracula-theme-from-intellij"
vscode "upstash.context7-mcp"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wicked-labs.wvsc-serendipity"
vscode "xyz.local-history"
vscode "yoshinorin.current-file-path"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
cargo "agg"
cargo "cargo-zigbuild"
uv "rendergit"
npm "@google/gemini-cli"
npm "@googleworkspace/cli"
npm "@openai/codex"
npm "@steipete/summarize"
npm "@virtuslab/visdom-ui"
npm "@visdom/ui"
npm "clawdbot"
npm "clawdhub"
npm "cline"
npm "corepack"
npm "happy-coder"
npm "mcporter"
npm "openclaw"
npm "pnpm"
npm "terminalizer"
npm "vercel"
